#Вам дано положительное число
#определите сколько цифр он имеет

number = 11230456987123
str_number = str(number)
print(len(str_number))